Metakinhsh : Elegxos gia empodia(gia na mporei o ippoths na mhn pernaei mprosta apo ta empodia);


Epithesh: elegxoume ean uparxei kapios enemy mprosta;


Epitheseis: ~Punch: Controll f,Energy 50,Damage 1,αν πίσω του έχει κενό τετράγωνο ο εχθρός οπισθοχωρεί κατά μία θέση.
			
			~Axe: ContOll a,Energy 70,Damage 1 ,αφαιρεί από έναν πόντο ζωής σε καθέναν από δύο μεμονωμένους εχθρούς
					που βρίσκονται στοιχισμένοι (ο ένας πίσω από τον άλλο) μπροστά στον ιππότη. 							  
					Aν 	πίσω από τον πιο απομακρυσμένο εχθρό έχει κενό τετράγωνο οπισθοχωρoyn και οι δύο κατά μία θέση.

		 	~Slash: Controll s,Energy 80,Damage 1 ,αφαιρεί από έναν πόντο ζωής σε καθέναν από τρεις μεμονωμένους εχθρούς 
					που βρίσκονται σε παράταξη (ο ένας δίπλα από τον άλλο)  μπροστά στον ιππότη.
					Αν πίσω από έναν ή παραπάνω εχθρούς έχει κενό τετράγωνο αυτοί οπισθοχωρούν κατά μία θέση.

			~Arrow: Controll b,Energy 60,Damage 1 ,αφαιρεί από έναν πόντο ζωής στον εχθρό που μία βρίσκονται θέση μακριά από τον ιππότη 	
				    (υπάρχει δηλαδή κενό τετράγωνο ή εμπόδιο ανάμεσα στον ιππότη και τον εχθρό που πλήτετται).  
					Αν πίσω του έχει κενό τετράγωνο ο εχθρός οπισθοχωρεί κατά μία θέση.



	"Προσέξτε ότι αν γίνει μία ενέργεια (μπουνιά,  τσεκουριά,  χαρακιά,  βολή) και μπροστά στον ιππότη δεν βρίσκονται
    "εχθροί (δηλαδή έχει κενά τετράγωνα ή εμπόδια) τότε ο ιππότης δεν χρεώνεται κάτι (γιατί έκανε “airball”)."

	"Αν όμως βρίσκεται έστω και ένας εχθρός η χρέωση γίνεται κανονικά στο σύνολό της."

Metakinhsh: Αν ο ιππότης λάβει εντολή ενέργειας (μπουνιά, τσεκουριά, χαρακιά, ή βολή)θα πρέπει να την εκτελέσει προς την κατεύθυνση που κοιτάει
			Η κατεύθυνση που κοιτάει ο ιππότης είναι προς τα εκεί που εκτέλεσε την τελευταία εντολή μετακίνησής του.
